---
kind: event
id: E:Autodesk.Revit.UI.UIControlledApplication.ThemeChanged
source: html/b363351c-cb5d-f361-fbae-0c3ad37cc4c0.htm
---
# Autodesk.Revit.UI.UIControlledApplication.ThemeChanged Event

Subscribe to the ThemeChanged event to be notified after the theme was changed.

## Syntax (C#)
```csharp
public event EventHandler<ThemeChangedEventArgs> ThemeChanged
```

## Remarks
This event is raised after the theme was changed.